# Pandas (pt 2)

In [1]:
import numpy as np
import pandas as pd

## 1. Data frames

- Data frame thể hiện cấu trúc dạng bảng như excel sheet
- Có rows và columns
- Mỗi column là một Series

Dùng dict

In [2]:
d = {
    "name" : ["John", "Bob", "Jane", "Jack"],
    "age" : [30, 40, 50, np.nan],
    "edu" : ["BS", "MS", "BS", np.nan]
}
df = pd.DataFrame(d)
df

   name   age  edu
0  John  30.0   BS
1   Bob  40.0   MS
2  Jane  50.0   BS
3  Jack   NaN  NaN

Dùng list 2 chiều

In [3]:
l = [
    ("John", 18, "BS"),
    ("Bod", 20, "MS"),
    ("Jane", 40, "BS")
]

df = pd.DataFrame(l, columns = ["name", "age", "edu"])
df

   name  age edu
0  John   18  BS
1   Bod   20  MS
2  Jane   40  BS

### Create a DF

In [4]:
# Create
df = pd.DataFrame([1, 2, 3, 4, 5])

In [5]:
# View
df

   0
0  1
1  2
2  3
3  4
4  5

In [6]:
# View type

In [7]:
# Dtype

Other ways

In [8]:
# From list

From a dict of list

In [9]:
# From dict

## 2. Read files

In [10]:
# Read csv

In [11]:
# Read txt

In [12]:
# Read excel

## 3. Operations with DF

In [13]:
# Load a CSV file
df = pd.read_csv("data/ico.csv", encoding='unicode_escape')

In [14]:
# First few rows : Nhìn data các dòng đầu tiên
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [15]:
# Last few rows
df.tail(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [16]:
# Num rows and num cols
df.shape

(541909, 8)

In [17]:
# Num rows
df.shape[0]

541909

In [18]:
# Get column names
df.columns.tolist()

['InvoiceNo',
 'StockCode',
 'Description',
 'Quantity',
 'InvoiceDate',
 'UnitPrice',
 'CustomerID',
 'Country']

In [19]:
# Get column names in list format
df.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [20]:
# Transpose đổi hàng thành cột
df.head().T

,0,1,2,3,4
InvoiceNo,536365,536365,536365,536365,536365
StockCode,85123A,71053,84406B,84029G,84029E
Description,WHITE HANGING HEART T-LIGHT HOLDER,WHITE METAL LANTERN,CREAM CUPID HEARTS COAT HANGER,KNITTED UNION FLAG HOT WATER BOTTLE,RED WOOLLY HOTTIE WHITE HEART.
Quantity,6,6,8,6,6
InvoiceDate,12/1/2010 8:26,12/1/2010 8:26,12/1/2010 8:26,12/1/2010 8:26,12/1/2010 8:26
UnitPrice,2.55,3.39,2.75,3.39,3.39
CustomerID,17850.0,17850.0,17850.0,17850.0,17850.0
Country,United Kingdom,United Kingdom,United Kingdom,United Kingdom,United Kingdom

### C) Thao tác với cột

- Truy xuất 1 cột -> trả về 1 series

In [21]:
df["InvoiceNo"]

0         536365
1         536365
2         536365
3         536365
4         536365
           ...
541904    581587
541905    581587
541906    581587
541907    581587
541908    581587
Name: InvoiceNo, Length: 541909, dtype: object

In [22]:
# Có bao nhiêu giá trị khác nhau
df["InvoiceNo"].nunique()

25900

In [23]:
# Số lượng các giá trị 
df["Country"].value_counts()

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [24]:
# Mỗi country chiếm bao nhiêu phần trăm
df["Country"].value_counts(normalize = True)

United Kingdom          0.914320
Germany                 0.017521
France                  0.015790
EIRE                    0.015124
Spain                   0.004674
Netherlands             0.004375
Belgium                 0.003818
Switzerland             0.003694
Portugal                0.002803
Australia               0.002323
Norway                  0.002004
Italy                   0.001482
Channel Islands         0.001399
Finland                 0.001283
Cyprus                  0.001148
Sweden                  0.000853
Unspecified             0.000823
Austria                 0.000740
Denmark                 0.000718
Japan                   0.000661
Poland                  0.000629
Israel                  0.000548
USA                     0.000537
Hong Kong               0.000531
Singapore               0.000423
Iceland                 0.000336
Canada                  0.000279
Greece                  0.000269
Malta                   0.000234
United Arab Emirates    0.000125
European Community      0.000113
RSA                     0.000107
Lebanon                 0.000083
Lithuania               0.000065
Brazil                  0.000059
Czech Republic          0.000055
Bahrain                 0.000035
Saudi Arabia            0.000018
Name: Country, dtype: float64

In [25]:
# Lấy 10 giá trị có số lượng nhiều nhất
df["InvoiceNo"].value_counts().head(10)

573585    1114
581219     749
581492     731
580729     721
558475     705
579777     687
581217     676
537434     675
580730     662
538071     652
Name: InvoiceNo, dtype: int64

In [26]:
# 10 thằng có value thấp nhất
df["InvoiceNo"].value_counts().tail(10)

C546511    1
574176     1
C568184    1
574173     1
574171     1
554023     1
554022     1
554021     1
554020     1
C558901    1
Name: InvoiceNo, dtype: int64

- Truy xuất nhiều cột -> trả vể dataFrame

In [27]:
# Get axes 
df[["InvoiceNo","UnitPrice", "UnitPrice"]].head()

  InvoiceNo  UnitPrice  UnitPrice
0    536365       2.55       2.55
1    536365       3.39       3.39
2    536365       2.75       2.75
3    536365       3.39       3.39
4    536365       3.39       3.39

- Chọn nhiều cột, dùng `.loc`(recommended)

In [28]:
df.loc[df["UnitPrice"] > 10,["InvoiceNo","UnitPrice"]].head()

    InvoiceNo  UnitPrice
45     536370      18.00
65     536374      10.95
141   C536379      27.50
151    536382      14.95
152    536382      14.95

- Chọn nhiều cột liên tiếp

In [29]:
df.loc[: , "Quantity" : "Country"].head()

   Quantity     InvoiceDate  UnitPrice  CustomerID         Country
0         6  12/1/2010 8:26       2.55     17850.0  United Kingdom
1         6  12/1/2010 8:26       3.39     17850.0  United Kingdom
2         8  12/1/2010 8:26       2.75     17850.0  United Kingdom
3         6  12/1/2010 8:26       3.39     17850.0  United Kingdom
4         6  12/1/2010 8:26       3.39     17850.0  United Kingdom

- Update cột có sẵn

In [30]:
# Giả sử quantity được lưu dưới đơn vị 100
# Giá trị 6 nghĩa là 6000
# Update lại cột này cho đúng giá trị

df["Quantity"] = df["Quantity"] * 1000
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6000,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6000,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [31]:
# update lại InvoiceDate về dạng datetime
df["InvoiceDate"] = pd.to_datetime(df["InvoiceDate"])
df["InvoiceDate"].head()

0   2010-12-01 08:26:00
1   2010-12-01 08:26:00
2   2010-12-01 08:26:00
3   2010-12-01 08:26:00
4   2010-12-01 08:26:00
Name: InvoiceDate, dtype: datetime64[ns]

In [32]:
# lấy ra ngày 
df["InvoiceDate"].dt.day

0         1
1         1
2         1
3         1
4         1
         ..
541904    9
541905    9
541906    9
541907    9
541908    9
Name: InvoiceDate, Length: 541909, dtype: int64

In [33]:
# XuấInvoiceDatet ra năm -> tháng -> ngày 
df["InvoiceDate"].dt.strftime("%Y - %m - %d")
df["InvoiceDate"]

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541904   2011-12-09 12:50:00
541905   2011-12-09 12:50:00
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
Name: InvoiceDate, Length: 541909, dtype: datetime64[ns]

- Thêm cột mới

In [34]:
df["Revenue"] = df["Quantity"] * df["UnitPrice"]

In [35]:
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6000,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15300.0
1,536365,71053,WHITE METAL LANTERN,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0

- Thao tác với cột `datetime`

In [36]:
df["InvoiceDate"]

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541904   2011-12-09 12:50:00
541905   2011-12-09 12:50:00
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
Name: InvoiceDate, Length: 541909, dtype: datetime64[ns]

In [37]:
df["InvoiceDate"].dt.year

0         2010
1         2010
2         2010
3         2010
4         2010
          ...
541904    2011
541905    2011
541906    2011
541907    2011
541908    2011
Name: InvoiceDate, Length: 541909, dtype: int64

In [38]:
df["InvoiceDate"].dt.month

0         12
1         12
2         12
3         12
4         12
          ..
541904    12
541905    12
541906    12
541907    12
541908    12
Name: InvoiceDate, Length: 541909, dtype: int64

In [39]:
df["InvoiceDate"].dt.day

0         1
1         1
2         1
3         1
4         1
         ..
541904    9
541905    9
541906    9
541907    9
541908    9
Name: InvoiceDate, Length: 541909, dtype: int64

In [40]:
df["Date_VIE"] = df["InvoiceDate"].dt.strftime("%Y/%m/%d")

In [41]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue,Date_VIE
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6000,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15300.0,2010/12/01
1,536365,71053,WHITE METAL LANTERN,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8000,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22000.0,2010/12/01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01
...,...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12000,2011-12-09 12:50:00,0.85,12680.0,France,10200.0,2011/12/09
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6000,2011-12-09 12:50:00,2.10,12680.0,France,12600.0,2011/12/09
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4000,2011-12-09 12:50:00,4.15,12680.0,France,16600.0,2011/12/09
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4000,2011-12-09 12:50:00,4.15,12680.0,France,16600.0,2011/12/09
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3000,2011-12-09 12:50:00,4.95,12680.0,France,14850.0,2011/12/09

In [42]:
df.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID            float64
Country                object
Revenue               float64
Date_VIE               object
dtype: object

In [43]:
df["Country"]\
    .value_counts(normalize=True)\
    .sort_index(ascending = False)

Unspecified             0.000823
United Kingdom          0.914320
United Arab Emirates    0.000125
USA                     0.000537
Switzerland             0.003694
Sweden                  0.000853
Spain                   0.004674
Singapore               0.000423
Saudi Arabia            0.000018
RSA                     0.000107
Portugal                0.002803
Poland                  0.000629
Norway                  0.002004
Netherlands             0.004375
Malta                   0.000234
Lithuania               0.000065
Lebanon                 0.000083
Japan                   0.000661
Italy                   0.001482
Israel                  0.000548
Iceland                 0.000336
Hong Kong               0.000531
Greece                  0.000269
Germany                 0.017521
France                  0.015790
Finland                 0.001283
European Community      0.000113
EIRE                    0.015124
Denmark                 0.000718
Czech Republic          0.000055
Cyprus                  0.001148
Channel Islands         0.001399
Canada                  0.000279
Brazil                  0.000059
Belgium                 0.003818
Bahrain                 0.000035
Austria                 0.000740
Australia               0.002323
Name: Country, dtype: float64

In [44]:
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue,Date_VIE
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6000,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15300.0,2010/12/01
1,536365,71053,WHITE METAL LANTERN,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01

In [45]:
# Upper cột Country 
df["Country"].str.upper().head(2)

0    UNITED KINGDOM
1    UNITED KINGDOM
Name: Country, dtype: object

In [46]:
# Lower cột Country 
df["Country"].str.lower().head(1)

0    united kingdom
Name: Country, dtype: object

In [47]:
df["Description"].str.capitalize().head()

0     White hanging heart t-light holder
1                    White metal lantern
2         Cream cupid hearts coat hanger
3    Knitted union flag hot water bottle
4         Red woolly hottie white heart.
Name: Description, dtype: object

In [48]:
df["Description"].str.title().head()

0     White Hanging Heart T-Light Holder
1                    White Metal Lantern
2         Cream Cupid Hearts Coat Hanger
3    Knitted Union Flag Hot Water Bottle
4         Red Woolly Hottie White Heart.
Name: Description, dtype: object

## Thao tác với dòng (filter)

In [49]:
df.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID            float64
Country                object
Revenue               float64
Date_VIE               object
dtype: object

In [50]:
df["Year"] = df["InvoiceDate"].dt.year
df["Month"] = df["InvoiceDate"].dt.month
df["Day"] = df["InvoiceDate"].dt.day

In [51]:
df["Day"].unique().tolist()

[1,
 2,
 3,
 5,
 6,
 7,
 8,
 9,
 10,
 12,
 13,
 14,
 15,
 16,
 17,
 19,
 20,
 21,
 22,
 23,
 4,
 11,
 18,
 24,
 25,
 26,
 27,
 28,
 30,
 31,
 29]

- Lọc ra tất cả các hoá đơn trong 10 đến 20 của tháng 7 năm 2010
- Có bao nhiêu dòng như vậy

In [52]:
cond = (df["Day"] >= 10)\
    & (df["Day"] <= 20)\
    & (df["Year"] == 2011)\
    & (df["Month"] == 7)
df.loc[cond , :].shape

(15654, 13)

In [53]:
cond= (df["InvoiceDate"] >= "2011/07/10") & (df["InvoiceDate"] < "2011/07/21")
df.loc[cond , :].shape

(15654, 13)

- Lọc ra những sản phẩm description có chưa `STRAWBERY`

In [54]:
cond = df["Description"]\
    .str.upper()\
    .str.contains("WHITE METAL") == True
df.loc[cond , ["StockCode", "Description"]]

       StockCode                    Description
1          71053            WHITE METAL LANTERN
50         71053            WHITE METAL LANTERN
67         71053            WHITE METAL LANTERN
279        71053            WHITE METAL LANTERN
417        71053            WHITE METAL LANTERN
...          ...                            ...
473150     22826  LOVE SEAT ANTIQUE WHITE METAL
475528     71053            WHITE METAL LANTERN
490300     22826  LOVE SEAT ANTIQUE WHITE METAL
493383     22826  LOVE SEAT ANTIQUE WHITE METAL
519798     22826  LOVE SEAT ANTIQUE WHITE METAL

[373 rows x 2 columns]

In [55]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue,Date_VIE,Year,Month,Day
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6000,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15300.0,2010/12/01,2010,12,1
1,536365,71053,WHITE METAL LANTERN,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01,2010,12,1
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8000,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22000.0,2010/12/01,2010,12,1
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01,2010,12,1
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01,2010,12,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12000,2011-12-09 12:50:00,0.85,12680.0,France,10200.0,2011/12/09,2011,12,9
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6000,2011-12-09 12:50:00,2.10,12680.0,France,12600.0,2011/12/09,2011,12,9
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4000,2011-12-09 12:50:00,4.15,12680.0,France,16600.0,2011/12/09,2011,12,9
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4000,2011-12-09 12:50:00,4.15,12680.0,France,16600.0,2011/12/09,2011,12,9
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3000,2011-12-09 12:50:00,4.95,12680.0,France,14850.0,2011/12/09,2011,12,9

In [56]:
cond = df["Description"].str.len() >= 30
df.loc[cond , :].shape

(187121, 13)

In [57]:
df["Description"] = df["Description"].fillna("")

In [58]:
# Description > 5 từ (khoảng trăng là ký tự phân cách từ)
df["n_words"] = df["Description"].str.split().apply(lambda x: len(x))

In [59]:
df[["Description", "n_words"]].head(2)

                          Description  n_words
0  WHITE HANGING HEART T-LIGHT HOLDER        5
1                 WHITE METAL LANTERN        3

In [60]:
df["Description"].apply(lambda s: s[:3])

0         WHI
1         WHI
2         CRE
3         KNI
4         RED
         ...
541904    PAC
541905    CHI
541906    CHI
541907    CHI
541908    BAK
Name: Description, Length: 541909, dtype: object

In [61]:
df.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue,Date_VIE,Year,Month,Day,n_words
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6000,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15300.0,2010/12/01,2010,12,1,5
1,536365,71053,WHITE METAL LANTERN,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01,2010,12,1,3

In [62]:
df["CAT"] = df["Description"].apply(lambda x: x[:3])
df["SubCat"] = df["Description"].apply(lambda x: x[-4:])

In [63]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue,Date_VIE,Year,Month,Day,n_words,CAT,SubCat
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6000,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15300.0,2010/12/01,2010,12,1,5,WHI,LDER
1,536365,71053,WHITE METAL LANTERN,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01,2010,12,1,3,WHI,TERN
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8000,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22000.0,2010/12/01,2010,12,1,5,CRE,NGER
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01,2010,12,1,6,KNI,TTLE
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6000,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20340.0,2010/12/01,2010,12,1,5,RED,ART.
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12000,2011-12-09 12:50:00,0.85,12680.0,France,10200.0,2011/12/09,2011,12,9,5,PAC,KINS
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6000,2011-12-09 12:50:00,2.10,12680.0,France,12600.0,2011/12/09,2011,12,9,4,CHI,IRL
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4000,2011-12-09 12:50:00,4.15,12680.0,France,16600.0,2011/12/09,2011,12,9,4,CHI,IRL
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4000,2011-12-09 12:50:00,4.15,12680.0,France,16600.0,2011/12/09,2011,12,9,4,CHI,RADE
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3000,2011-12-09 12:50:00,4.95,12680.0,France,14850.0,2011/12/09,2011,12,9,5,BAK,POT

In [64]:
df["Country"] = df["Country"].fillna("")

In [65]:
df["Country"].str.split().apply(lambda x: x[0])

0         United
1         United
2         United
3         United
4         United
           ...
541904    France
541905    France
541906    France
541907    France
541908    France
Name: Country, Length: 541909, dtype: object

In [82]:
# Kiểm tra Description bắt đầu bằng mini
cond = df["Description"].str.lower().str.startswith("mini") == True

df.loc[cond , ["Description"] ]

                           Description
42          MINI JIGSAW CIRCUS PARADE
43                MINI JIGSAW SPACEBOY
44             MINI PAINT SET VINTAGE
479            MINI PAINT SET VINTAGE
817            MINI FUNKY DESIGN TAPES
...                                ...
541503  MINI LIGHTS WOODLAND MUSHROOMS
541554            MINI JIGSAW SPACEBOY
541567  MINI LIGHTS WOODLAND MUSHROOMS
541568             MINI JIGSAW BUNNIES
541823  MINI LIGHTS WOODLAND MUSHROOMS

[3662 rows x 1 columns]

In [83]:
# Kiểm tra Description kết thúc bằng red
cond = df["Description"].str.lower().str.endswith("red") == True

df.loc[cond , ["Description"] ]

                            Description
52                EDWARDIAN PARASOL RED
69                EDWARDIAN PARASOL RED
187         GINGHAM HEART  DOORSTOP RED
282               EDWARDIAN PARASOL RED
322             SILK PURSE BABUSHKA RED
...                                 ...
540915                 LIPSTICK PEN RED
541325            EDWARDIAN PARASOL RED
541352      GINGHAM HEART  DOORSTOP RED
541416  AIRLINE BAG VINTAGE JET SET RED
541653          DRAWER KNOB CERAMIC RED

[2218 rows x 1 columns]

## E) Thao tác hàng và cột cùng lúc
- Lọc ra những đơn hàng có quantity `>=1,000` và chỉ giữ lại cột `InvoiceDate`, `Quatity`, `UnitPrice`

In [81]:
# Cách 1: break down
cond = df["Quantity"] >= 1e3
cols = ["InvoiceDate", "Quantity", "UnitPrice"]
df.loc[cond, cols]

               InvoiceDate  Quantity  UnitPrice
0      2010-12-01 08:26:00      6000       2.55
1      2010-12-01 08:26:00      6000       3.39
2      2010-12-01 08:26:00      8000       2.75
3      2010-12-01 08:26:00      6000       3.39
4      2010-12-01 08:26:00      6000       3.39
...                    ...       ...        ...
541904 2011-12-09 12:50:00     12000       0.85
541905 2011-12-09 12:50:00      6000       2.10
541906 2011-12-09 12:50:00      4000       4.15
541907 2011-12-09 12:50:00      4000       4.15
541908 2011-12-09 12:50:00      3000       4.95

[531285 rows x 3 columns]

In [80]:
df.head(1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Revenue,Date_VIE,Year,Month,Day,n_words,CAT,SubCat
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6000,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15300.0,2010/12/01,2010,12,1,5,WHI,LDER

## 4. Summary stats

### Five-number summary
- Important location: Min, max, mean/median, Q1, Q3

In [66]:
# Create dummy data for revenue

In [67]:
# Min of each col

In [68]:
# Min of a particular col

In [69]:
# Max of each col

In [70]:
# Min of a particular col

In [71]:
# Mean/Median of each col

In [72]:
# Mean/Median of a particular col

In [73]:
# Var/Std of each col

In [74]:
# Var/Std of a particular col

In [75]:
# Cummulative agg